In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [9]:
 df.dropna()#linhas sem vazio

     A    B  C
0  1.0  5.0  1

In [11]:
 df.dropna(axis=1)#colunas

   C
0  1
1  2
2  3

In [13]:
df.dropna(thresh=2)#falta na linha x quantidade

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [15]:
df.fillna(value='x')

     A    B  C
0  1.0  5.0  1
1  2.0    x  2
2    x    x  3

In [17]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [21]:
df.fillna(method='ffill')

C:\Users\jpedr\AppData\Local\Temp\ipykernel_2964\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3